#це текст, над яким виконуються операції

text  = '''Народження байки сягає глибини тисячоліть. Люди любили слухати й розповідати історії про добрих або злих, розумних або дурних, 
хитрих або простакуватих тварин. Ці оповідки могли бути довгими або коротенькими. Усе залежало від мети й натхнення оповідача, 
а також настрою слухачів. Коли не треба було поспішати і всі були в доброму гуморі, то розповіді тривали годинами. 
Якщо виникала потреба у швидкій дотепній відповіді, то оповідка ставала дуже короткою.'''


#Виконано студентом КН-35 Воронко

print("Кількість літер 'a' у тексті: ", text.count("а"))
print("Кількість слів у тексті: ", len(text.split()))
print("Чи є в тексті слово 'Україна': ", "ні" if text.find('Україна') == -1 else "так")