# початковий масив зі словниками 

students = [
    {
        "fullName":"Петренко Антон Федорович",
        "groupNumber": "КН-13",
        "course": 2,
        "marks": {
            "ММДО": 79,
            "Чисельні методи": 80,
            "Програмування мовою Python": 90,
        }
    },
    {
        "fullName":"Мельник Олена Іванівна",
        "groupNumber": "ЕТ-36",
        "course": 3,
        "marks": {
            "Розробка програмних продуктів": 65,
            "Алгоритми та структури даних": 80,
            "Адміністрування баз даних": 78,
        }
    },
    {
        "fullName":"Андрієнко Петро Миколайович",
        "groupNumber": "СУ-13",
        "course": 3,
        "marks": {
            "Логіка": 100,
            "Політологія": 62,
            "Вища математика": 80,
        }
    },
]