# початковий масив зі словниками 

group = {
    "groupNumber": "СУ-13",
    "course": 3,
    "students":[
        {
            "fullName":"Петренко Антон Федорович",
            "marks": {
                "ММДО": 100,
                "Чисельні методи": 60,
                "Програмування мовою Python": 60,
            }
        },
        {
            "fullName":"Мельник Олена Іванівна",
            "marks": {
                "ММДО": 80,
                "Чисельні методи": 80,
                "Програмування мовою Python": 90,
            }
        },
        {
            "fullName":"Андрієнко Петро Миколайович",
            "marks": {
                "ММДО": 60,
                "Чисельні методи": 80,
                "Програмування мовою Python": 75,
            }
        },
    ]
}